livewire_api/app/controllers/api/v1/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ?  [["user_id", 1]]
---
   def index
      @portfolios = Portfolio.all.where(:user_id => params["user_id"])

INSERT INTO "portfolios" ("portfolio_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["portfolio_name", "Health"], ["user_id", 2], ["created_at", "2021-01-25 11:53:36.559816"], ["updated_at", "2021-01-25 11:53:36.559816"]]
---
   def create
        @portfolio = Portfolio.create(portfolio_params)