livewire_api/app/controllers/api/v1/users_controller.rb

SELECT "users"."id" FROM "users"
---
  def index
    @users = User.all
    session[:u_id] = current_user.id
    p session[:u_id]
    if @users.ids.include? current_user.id