livewire_api/app/models/user.rb

  def self.from_token_payload(payload)
    self.find payload["sub"]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]